{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_16","layers":[{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense31","trainable":true,"batch_input_shape":[null,784],"dtype":"float32"}},{"class_name":"Dense","config":{"units":10,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense32","trainable":true}}]},"keras_version":"tfjs-layers 3.14.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.14.0","convertedBy":null,"weightsManifest":[{"paths":["./my-model-1.weights.bin"],"weights":[{"name":"dense_Dense31/kernel","shape":[784,32],"dtype":"float32"},{"name":"dense_Dense31/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense32/kernel","shape":[32,10],"dtype":"float32"},{"name":"dense_Dense32/bias","shape":[10],"dtype":"float32"}]}]}